# 01. Importing Libraries

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 02. Importing Data

In [2]:
# path shortcut
path = r'C:\Users\georg\Documents\2025-02-05 Instacart Basket Analysis'

In [3]:
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

# 03. Wrangle Data

In [4]:
df_cust.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [5]:
# change col names
df_cust.rename(columns = {'First Name' : 'first_name', 
                          'Surnam' : 'last_name',
                          'Gender' : 'gender',
                          'STATE' : 'state',
                          'Age' : 'age',
                          'fam_status' : 'family_status'}, inplace = True)

In [6]:
df_cust.head(10)

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

#### i changed all column headers to lower case. I renamed surnam to last_name
#### i thought about removing the gender & n_dependants columns, but thought that they might be useful at some point so i decdied to keep all columns for now.

In [7]:
df_cust.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

#### nothing out of the ordinary here

In [8]:
df_cust.shape

(206209, 10)

In [9]:
# Checking for mixed types
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].map(type)  != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
            print (col)

first_name

#### I should check if this is due to missing values before changing to teh whole column to string.

# 04. Data Checks

In [10]:
# looking for missing values
df_cust.isnull().sum()

user_id              0
first_name       11259
last_name            0
gender               0
state                0
age                  0
date_joined          0
n_dependants         0
family_status        0
income               0
dtype: int64

#### seems like there are some missing values in the first_name col

In [11]:
# creating a small table with the missing values
df_nan = df_cust[df_cust['first_name'].isnull() == True]

In [12]:
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [13]:
df_test = df_cust.loc[df_cust['user_id'] == 121317, ['user_id', 'first_name', 'last_name', 'state', 'age']]

In [14]:
df_test

        user_id first_name last_name         state  age
206038   121317        NaN    Melton  Pennsylvania   28

#### i wanted to see if there wre any duplicates of the user_ids in the NaN df, maybe one of them had a first name. 
#### i tested a bunch, all of the user_ids had just the one entry with a missing value for a first_name

In [15]:
# goign to look for duplicates in the user_id col
df_cust_user_ids = df_cust.get('user_id')
df_cust_user_ids

0          26711
1          33890
2          65803
3         125935
4         130797
           ...
206204    168073
206205     49635
206206    135902
206207     81095
206208     80148
Name: user_id, Length: 206209, dtype: int64

In [16]:
df_cust_user_ids = df_cust_user_ids[df_cust_user_ids.duplicated()]

In [17]:
df_cust_user_ids

Series([], Name: user_id, dtype: int64)

#### no duplicates in the user id col

In [18]:
# creating a subset of the df that only contains duplicates
df_cust_dups = df_cust[df_cust.duplicated()]

In [19]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, family_status, income]
Index: []

#### no duplicates were found

In [20]:
# importing orders & products merged df
df_ords_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_grouped.pkl'))

# 05. Merging Datasets

In [21]:
# checking datatypes
df_cust.dtypes

user_id           int64
first_name       object
last_name        object
gender           object
state            object
age               int64
date_joined      object
n_dependants      int64
family_status    object
income            int64
dtype: object

In [22]:
df_ords_prods_merged.dtypes

Unnamed: 0.1                       int64
Unnamed: 0_x                       int64
order_id                           int64
user_id                            int64
order_number                       int64
order_day_of_week                  int64
time_of_order                      int64
days_since_prior_order           float64
product_id                         int64
add_to_cart_order                  int64
reordered                          int64
Unnamed: 0_y                       int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
_merge                          category
price_range_loc                   object
busiest_day                       object
day_activity_level                object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
avg_product_price                float64
spending_flag                     object
medain_days_since_last_order     float64
order_frequency_flag              object
dtype: object

#### user_id cols are both int64, should have no probelms mergeing

In [25]:
df_merged = df_ords_prods_merged.merge(df_cust, on = 'user_id')

In [27]:
# exporting new df
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', '2025.02.13_Data.pkl'))